app/controllers/plants_controller.rb

	def index
		@plants = Plant.all
---
SELECT "plants".* FROM "plants"

    def find_plant
        @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]